TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НахождениеВагоновНаПутяхСРПВ/гкс_НахождениеВагоновНаПутяхСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НахождениеВагоновНаПутяхСРПВ</name>
  <resources>
    <name>WaggonDispatchId</name>
    <type>
      <types>DefinedType.гкс_WagonDispatchID</types>
    </type>
  </resources>
  <resources>
    <name>WaggonIndexPark</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Вагон</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Путь</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоответствияОбъектовСРПВ/гкс_СоответствияОбъектовСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоответствияОбъектовСРПВ</name>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.гкс_ИнтеграцияСРПВСправочники</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОбъектаСРПВ</name>
    <type>
      <types>EnumRef.гкс_ТипыОбъектовСРПВ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСРПВ</name>
    <comment>Идентификатор объекта СРПВ</comment>
    <type>
      <types>DefinedType.гкс_ИдентификаторыСРПВ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_АРМПриемкиНаПЛКСписокРегистраций/гкс_АРМПриемкиНаПЛКСписокРегистраций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_АРМПриемкиНаПЛКСписокРегистраций</name>
  <comment>ERP-1688</comment>
  <resources>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоДокумент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоДокумент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТарыДокумент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументНаправлениеНаРазгрузку</name>
    <type>
      <types>DocumentRef.гкс_НаправлениеНаРазгрузку</types>
    </type>
  </resources>
  <resources>
    <name>ДокументРегистрацииАнализов</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </resources>
  <resources>
    <name>ДокументРегистрацииВъезда</name>
    <type>
      <types>DocumentRef.гкс_Взвешивание</types>
    </type>
  </resources>
  <resources>
    <name>ДокументРегистрацииВыезда</name>
    <type>
      <types>DocumentRef.гкс_Взвешивание</types>
    </type>
  </resources>
  <resources>
    <name>ДокументФормированиеНомераПробы</name>
    <type>
      <types>DocumentRef.гкс_ФормированиеНомераПробы</types>
    </type>
  </resources>
  <resources>
    <name>ЖиваяОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>CatalogRef.гкс_НомерПробы</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонениеБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>СкладПлан</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортныйДокумент</name>
    <comment>ERP-1765</comment>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ЯмаРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </resources>
  <resources>
    <name>СтанцияЖД</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыОбъектовСРПВ/гкс_ТипыОбъектовСРПВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыОбъектовСРПВ</name>
  <enumValues>
    <name>ПЛК</name>
  </enumValues>
  <enumValues>
    <name>Весы</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>СтруктураПЛК</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НаправлениеНаРазгрузку/гкс_НаправлениеНаРазгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_НаправлениеНаРазгрузку</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйСтатус</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯмаРазгрузки</name>
    <comment>ERP-1094</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебнаяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеМестаРазгрузки</name>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>СлужебнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяРазгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯмаРазгрузки</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтруктураПЛК/гкс_СтруктураПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_СтруктураПЛК</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВъездНаПЛК</name>
      <description>Въезд на ПЛК</description>
    </items>
  </predefined>
  <attributes>
    <name>НомерПроезда</name>
    <comment>Номер проезда (Кверион)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <comment>для совместимости со страым механизмом назначения ям</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспортныхСредств</name>
    <comment>Обслуживаемый тип транспортных средств</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбратногоПроезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеПоискаГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОсей</name>
    <type>
      <types>EnumRef.гкс_КоличествоОсейТранспортногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСправочникПЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НахождениеВагоновНаПутяхСРПВ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает в регистр актуальную информацию о положении вагонов на путях.
// 
// Параметры:
//  ДанныеОПоложенииВагонов - Массив - коллекция с данными о положении вагонов в виде структур.
Процедура АктуализироватьИнформациюОПоложенииВагоновНаПутях(ДанныеОПоложенииВагонов) Экспорт
	
	ТаблицаДляЗагрузки = ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов);
	Если Не ТаблицаДляЗагрузки = Неопределено Тогда 
		ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет Склад и Яму разгрузки в документе НаправлениеНаРазгрузку при перемещении вагона на путь из 
// Доступных мест разгрузки. Метод вызывается регламентным заданием гкс_ОбновлениеИнформацииОВагонахСРПВ.
Процедура ОбновитьМестаРазгрузкиПоТекущемуПоложениюВагона() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДляОбновленияМестРазгрузкиПоНахождениюВагона();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Склад"		, Выборка.Склад);
			ДанныеЗаполнения.Вставить("ЯмаРазгрузки", Выборка.ЯмаРазгрузки);
			Если Выборка.ЗаполнитьСлужебнуюНоменклатуру Тогда
				ДанныеЗаполнения.Вставить("СлужебнаяНоменклатура", Выборка.СлужебнаяНоменклатура);
			КонецЕсли;
			ДанныеЗаполнения.Вставить("НеРегистрироватьДляПередачиСРПВ", Истина);
			
			Документы.гкс_НаправлениеНаРазгрузку.СоздатьИзменитьИзАРМПриемки(
				ДанныеЗаполнения, Истина, Выборка.ДокументНаправлениеНаРазгрузку);
				
		Исключение

			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				"Интеграция СРПВ. Обновление направления на разгрузку", 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПредставлениеОшибки);
				
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьТаблицуДляЗагрузки(ДанныеОПоложенииВагонов)
	
	ТаблицаДляОбработки = ИнициализироватьТаблицаДляЗагрузки();
	МассивВТаблицуЗначений(ДанныеОПоложенииВагонов, ТаблицаДляОбработки);
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаСопоставленияОбъектов();
	Запрос.УстановитьПараметр("ДанныеДляЗагрузки"	, ТаблицаДляОбработки);
	Запрос.УстановитьПараметр("ДатаСостояния"		, ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		ДанныеДляЗагрузки = Неопределено;
	Иначе 
		
		НачатьТранзакцию();
		Попытка
			
			ДанныеДляЗагрузки = РезультатЗапроса.Выгрузить();
			Для Каждого СтрокаЗагрузки Из ДанныеДляЗагрузки Цикл
			
				// Дозаполнить ссылочные свойства коллекции.
				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Путь) Тогда
					СтрокаЗагрузки.Путь = НовыйПЛК(СтрокаЗагрузки);
					ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, "RailWayTrackIdPark", "Путь");
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(СтрокаЗагрузки.Вагон) Тогда
					СтрокаЗагрузки.Вагон = НовыйВагон(СтрокаЗагрузки);
					ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, "WaggonNumber", "Вагон");
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				"Интеграция СРПВ. Нахождение вагонов на путях", 
				УровеньЖурналаРегистрации.Ошибка,,, 
				ПредставлениеОшибки);
				
			ДанныеДляЗагрузки = Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ДанныеДляЗагрузки;
	
КонецФункции

Процедура ОбновитьВДанныхДляЗагрузки(ДанныеДляЗагрузки, СтрокаЗагрузки, ИмяПоляКлюча, ИмяОбновляемогоПоля)
	
	СтрокиОтбора = ДанныеДляЗагрузки.НайтиСтроки(
		Новый Структура(ИмяПоляКлюча, СтрокаЗагрузки[ИмяПоляКлюча]));
	Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл 
		СтрокаОтбора[ИмяОбновляемогоПоля] = СтрокаЗагрузки[ИмяОбновляемогоПоля];
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьАктуальныеДанные(ТаблицаДляЗагрузки)
	
	Попытка

		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаДляЗагрузки);
		НаборЗаписей.Записать(РежимЗамещения.Замещение);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Интеграция СРПВ. Нахождение вагонов на путях", 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ПредставлениеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

Функция НовыйПЛК(СтрокаДанных)
	
	ЖДПуть = Справочники.гкс_СтруктураПЛК.СоздатьЭлемент();
	ЖДПуть.УстановитьНовыйКод();
	ЖДПуть.Наименование = СтрокаДанных.RailWayTrackName;
	ЖДПуть.ТипТранспортныхСредств = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖДПуть.ОбменДанными.Загрузка = Истина;
	ЖДПуть.Записать();
	
	ДобавитьСоответствиеОбъекта(СтрокаДанных, ЖДПуть.Ссылка);
	
	Возврат ЖДПуть.Ссылка;
	
КонецФункции

Функция НовыйВагон(СтрокаДанных)
	
	ЖдВагон = Справочники.ТранспортныеСредства.СоздатьЭлемент();
	ЖдВагон.УстановитьНовыйКод();
	ЖдВагон.НомерТранспортногоСредства = СтрокаДанных.WaggonNumber;
	ЖдВагон.Наименование = СтрокаДанных.WaggonNumber;
	ЖдВагон.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	ЖдВагон.ОбменДанными.Загрузка = Истина;
	ЖдВагон.Записать();
	
	Возврат ЖдВагон.Ссылка;
	
КонецФункции

Процедура ДобавитьСоответствиеОбъекта(СтрокаДанных, Ссылка)
	
	МенеджерЗаписи = РегистрыСведений.гкс_СоответствияОбъектовСРПВ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторСРПВ = СтрокаДанных.RailWayTrackIdPark;
	МенеджерЗаписи.ТипОбъектаСРПВ = Перечисления.гкс_ТипыОбъектовСРПВ.СтруктураПЛК;
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура МассивВТаблицуЗначений(Массив, Таблица) Экспорт

	Для Каждого ЭлементМассива Из Массив Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), ЭлементМассива);
	КонецЦикла;

КонецПроцедуры

Функция ИнициализироватьТаблицаДляЗагрузки()
	
	ДлинаСтроки8 = 8;
	ДлинаСтроки10 = 10;
	ДлинаСтроки20 = 20;
	ДлинаСтроки25 = 25;
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("WaggonNumber", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки8));
	Таблица.Колонки.Добавить("WaggonDispatchId", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("WaggonIndexPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки10));
	Таблица.Колонки.Добавить("RailWayTrackIdPark", ОбщегоНазначения.ОписаниеТипаЧисло(ДлинаСтроки20));
	Таблица.Колонки.Добавить("RailWayTrackName", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки25));
	Таблица.Колонки.Добавить("PlcId", ОбщегоНазначения.ОписаниеТипаСтрока(ДлинаСтроки20));

	Возврат Таблица;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСопоставленияОбъектов()
	Возврат 
	"ВЫБРАТЬ
	|	ДЗ.WaggonNumber КАК WaggonNumber,
	|	ДЗ.WaggonDispatchId КАК WaggonDispatchId,
	|	ДЗ.WaggonIndexPark КАК WaggonIndexPark,
	|	ДЗ.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДЗ.RailWayTrackName КАК RailWayTrackName
	|ПОМЕСТИТЬ ДанныеПоВагонам
	|ИЗ
	|	&ДанныеДляЗагрузки КАК ДЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоВагонам.WaggonNumber КАК WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId КАК WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark КАК WaggonIndexPark,
	|	МАКСИМУМ(ЕСТЬNULL(ТранспортныеСредства.Ссылка, ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка))) КАК Вагон,
	|	ДанныеПоВагонам.RailWayTrackIdPark КАК RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName КАК RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка)) КАК Путь,
	|	МАКСИМУМ(&ДатаСостояния) КАК ДатаСостояния
	|ИЗ
	|	ДанныеПоВагонам КАК ДанныеПоВагонам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|		ПО ТранспортныеСредства.НомерТранспортногоСредства = ДанныеПоВагонам.WaggonNumber
	|		И ТранспортныеСредства.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|		И НЕ ТранспортныеСредства.ПометкаУдаления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК гкс_СоответствияОбъектовСРПВ
	|		ПО ДанныеПоВагонам.RailWayTrackIdPark = гкс_СоответствияОбъектовСРПВ.ИдентификаторСРПВ
	|		И гкс_СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.СтруктураПЛК)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоВагонам.WaggonNumber,
	|	ДанныеПоВагонам.WaggonDispatchId,
	|	ДанныеПоВагонам.WaggonIndexPark,
	|	ДанныеПоВагонам.RailWayTrackIdPark,
	|	ДанныеПоВагонам.RailWayTrackName,
	|	ЕСТЬNULL(гкс_СоответствияОбъектовСРПВ.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_СтруктураПЛК.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеПоВагонам";
КонецФункции

Функция ТекстЗапросаДляОбновленияМестРазгрузкиПоНахождениюВагона()
	Возврат 
	"ВЫБРАТЬ
	|	АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство КАК ТранспортноеСредство,
	|	НаправлениеНаРазгрузку.СлужебнаяНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК
	|		ЗаполнитьСлужебнуюНоменклатуру
	|ПОМЕСТИТЬ АРМПриемкиНаПЛКСписокРегистраций
	|ИЗ
	|	РегистрСведений.гкс_АРМПриемкиНаПЛКСписокРегистраций КАК АРМПриемкиНаПЛКСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку = НаправлениеНаРазгрузку.Ссылка
	|		И НаправлениеНаРазгрузку.ЯмаРазгрузки = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
	|		И НаправлениеНаРазгрузку.Склад = ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)
	|ГДЕ
	|	АРМПриемкиНаПЛКСписокРегистраций.ВидПеревозки = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НахождениеВагоновНаПутяхСРПВ.Вагон КАК Вагон,
	|	СтруктураПЛК.ТочкаМаршрута КАК ПутьТочкаМаршрута
	|ПОМЕСТИТЬ НахождениеВагоновНаПутяхСРПВ
	|ИЗ
	|	РегистрСведений.гкс_НахождениеВагоновНаПутяхСРПВ КАК НахождениеВагоновНаПутяхСРПВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|		ПО НахождениеВагоновНаПутяхСРПВ.Путь = СтруктураПЛК.Ссылка
	|ГДЕ
	|	НахождениеВагоновНаПутяхСРПВ.Вагон В
	|		(ВЫБРАТЬ
	|			АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство
	|		ИЗ
	|			АРМПриемкиНаПЛКСписокРегистраций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АРМПриемкиНаПЛКСписокРегистраций.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	АРМПриемкиНаПЛКСписокРегистраций.ЗаполнитьСлужебнуюНоменклатуру КАК ЗаполнитьСлужебнуюНоменклатуру,
	|	НахождениеВагоновНаПутяхСРПВ.ПутьТочкаМаршрута КАК ПутьТочкаМаршрута
	|ПОМЕСТИТЬ НаправленияНаРазгрузкуСПутями
	|ИЗ
	|	АРМПриемкиНаПЛКСписокРегистраций КАК АРМПриемкиНаПЛКСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НахождениеВагоновНаПутяхСРПВ КАК НахождениеВагоновНаПутяхСРПВ
	|		ПО АРМПриемкиНаПЛКСписокРегистраций.ТранспортноеСредство = НахождениеВагоновНаПутяхСРПВ.Вагон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументНаправлениеНаРазгрузку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаправленияНаРазгрузкуСПутями.ДокументНаправлениеНаРазгрузку КАК ДокументНаправлениеНаРазгрузку,
	|	НаправленияНаРазгрузкуСПутями.ЗаполнитьСлужебнуюНоменклатуру КАК ЗаполнитьСлужебнуюНоменклатуру,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.Силос КАК Склад,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.ЯмаРазгрузки КАК ЯмаРазгрузки
	|ИЗ
	|	НаправленияНаРазгрузкуСПутями КАК НаправленияНаРазгрузкуСПутями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку.ДоступныеМестаРазгрузки КАК
	|			НаправлениеНаРазгрузкуДоступныеМестаРазгрузки
	|		ПО НаправленияНаРазгрузкуСПутями.ДокументНаправлениеНаРазгрузку = НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.Ссылка
	|		И НаправленияНаРазгрузкуСПутями.ПутьТочкаМаршрута = НаправлениеНаРазгрузкуДоступныеМестаРазгрузки.ЯмаРазгрузки";
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
